{
  "levels": [
    {
      "level": "Gold",
      "level_subtitle": "Underwriters",
      "level_description": null,
      "donors": [
        {
          "logo": "hoeflerco.png",
          "alt": "Hoefler & Co. logo",
          "name": "Hoefler & Co.",
          "url": "http://www.typography.com/cloud/welcome/",
          "description": "<p>Hoefler & Co. is behind the public faces of some of the world’s foremost institutions, publications, and brands, in channels from print to web to mobile, and they provide typefaces to designers around the world through their website at typography.com. Their work is part of the permanent collection of the Museum of Modern Art in New York, and Fast Company has named them one of the most innovative design companies in America.</p>",
          "twitter" : "HoeflerCo"
        }
      ]
    },
    {
      "level": "Silver",
      "level_description": null,
      "donors": [
        {
          "logo": "oddbird.png",
          "alt": "OddBird logo",
          "name": "OddBird",
          "url": "http://meetup.com",
          "description": "<p>OddBird is a small team that thrives on freely shared ideas &amp; playful collaboration, crossing disciplines, breaking boundaries, and eating our dessert with the soup spoon. From working on open-source tools like Django, Compass, and Susy to building web applications for Mozilla, The K Network, Providence Plan, Junyo, or ORCAS&mdash;and our own experiments in digital storytelling&mdash;we love molding ideas into experiences that people can use.</p>",
          "twitter" : "oddestbirds"
        },
        {
          "logo": "makersquare.png",
          "alt": "MakerSquare logo",
          "name": "MakerSquare",
          "url": "http://makersquare.com",
          "description": "<p>MakerSquare is a software development training and educational company offering an immersive 12-week web development boot camp and a part-time, 10-week front-end boot camp in Austin, TX, Houston, TX and San Francisco, CA. Specialties include Web development education, Test Driven Development, Javascript Frameworks, Ruby on Rails, HTML5/CSS3, Javascript, jQuery, Git, Version Control, Popular APIs (Google Maps, Facebook), Templating languages: HAML, Pre-Processcors: Sass, LESS.</p>",
            "twitter" : "makersquare"
        }
      ]
    },
    {
      "level": "Party",
      "level_subtitle": "Yacht. Karaoke. NYC Harbor.",
      "level_description": null,
      "donors": [
        {
          "logo": "hoeflerco.png",
          "alt": "Hoefler & Co. logo",
          "name": "Hoefler & Co.",
          "url": "http://www.typography.com/cloud/welcome/",
          "description": "<p>Hoefler & Co. is behind the public faces of some of the world’s foremost institutions, publications, and brands, in channels from print to web to mobile, and they provide typefaces to designers around the world through their website at typography.com. Their work is part of the permanent collection of the Museum of Modern Art in New York, and Fast Company has named them one of the most innovative design companies in America.</p>",
          "twitter" : "HoeflerCo"
        }
      ]
    },

    {
      "level": "#SassWeek Sponsors",
      "level_description":"<p>The #RoadtoSassConf is a series of events free and open to anyone in New York City with SassConf speakers. Co-produed with GothamSass, NYC's Sass Meetup, and local sassy NYC companies.</p>",
      "donors": [
        {
          "logo": "meetup.png",
          "alt": "Meetup.com logo",
          "name": "Meetup",
          "url": "http://meetup.com",
          "description": "<p>Meetup is the world's largest network of local groups. Meetup makes it easy for anyone to organize a local group or find one of the thousands already meeting up face-to-face. More than 9,000 groups get together in local communities each day, each one with the goal of improving themselves or their communities.</p>",
          "twitter": "Meetup"
        },
        {
          "logo": "xotech.png",
          "alt": "XO Group logo",
          "name": "XO Tech",
          "url": "http://xogroup.com",
          "description": "<p>XO Tech is building innovative products that continue to revolutionize how women visualize, plan for and enjoy life's most important moments. We are highly focused on building a user-centric, product focused, mobile first organization with a refreshing, fun and entrepreneurial work culture.  For everyone at XO Group, a collaborative spirit is a must. Our teams are very dedicated and excited about what they do — and we work hard to maintain that atmosphere.</p>",
          "twitter": "XOGroupInc"
        },
        {
          "logo": "thoughtbot.png",
          "alt": "ThoughtBot logo",
          "name": "ThoughtBot",
          "url": "http://thoughtbot.com",
          "description": "<p>Core supporters of Bourbon, Neat, and many other open source projects. Also, we <3 SASS! We are a team of designers and developers. Clients hire us to solve problems for people. So, we interview potential customers. We sketch. We prototype. We make and ship working software, and we measure use of the software. Find us on Twitter @thoughtbot, or check out our blog at Giant Robots Smashing Into Other Giant Robots.</p>",
          "twitter": "thoughtbot"
        }
      ]
    },
    {
      "level": "Supporters",
      "level_description":"<p>These great companies provide us with giveaways and in-kind support.</p>",
      "donors": [
        {
          "logo": "bkapart.png",
          "alt": "A Book Apart logo",
          "name": "A Book Apart",
          "url": "http://www.abookapart.com",
          "description": "<p>A Book Apart publishes highly detailed and meticulously edited examinations of single topics. We produce brief books of about 100 pages — the perfect size in terms of subject depth and coverage for topics like HTML5, CSS3, content strategy, responsive web design, and more.</p><p>The goal of every title in our catalog is to shed clear light on a tricky subject, and do it fast, so you can get back to work. Thank you for supporting our mission to provide professionals with the tools they need to move the web forward.</p>",
          "twitter": "abookapart"
        },
        {
          "logo": "manning.png",
          "alt": "Manning logo",
          "name": "Manning",
          "url": "http://manning.com",
          "description": "<p>Manning is a publisher of computer books for professionals. Every new book teaches us something to help us improve. How to choose the topics; how to find the right authors; how to help authors write their manuscripts; how to ensure the content is valuable and easy to learn; how to get the word out about the book. Readers can access our books before they are finished through the Manning Early Access Program, and we make our books available through Safari and iBooks. Print copies, wherever they are bought, come with free electronic versions in PDF, ePub and Kindle formats, downloadable from the Manning site.</p>",
          "twitter" : "manning"
        },
        {
          "logo": "rosenfeld.png",
          "alt": "Rosenfeld Media logo",
          "name": "Rosenfeld Media",
          "url": "http://rosenfeld.com",
          "description": "<p>Rosenfeld Media provides deep user experience design expertise in the formats you need: 18 books, over 50 workshops, and consulting from dozens of the field's top experts.</p>",
          "twitter" : "rosenfeldmedia"
        },
        {
          "logo": "cage.png",
          "alt": "Cage logo",
          "name": "Cage",
          "url": "http://cageapp.com/",
          "description": "<p>Cage is a simple way to manage projects, people, communication, revisions, feedback, and approvals. Trusted by thousands of agencies, studios, and creative teams.</p>",
          "twitter" : "cageapp"

        },
        {
          "logo": "codekit.png",
          "alt": "Codekit logo",
          "name": "Codekit",
          "url": "https://incident57.com/codekit/",
          "description": "<p>CodeKit helps you build websites faster and better.</p>",
          "twitter":"Codekit"
        },
        {
          "logo": "tower.png",
          "alt": "Tower logo",
          "name": "Tower",
          "url": "http://git-tower.com",
          "description": "<p>Tower is the best Git client for Mac. Beginners will love the clean &amp; easy interface. And for experts, Tower has all this nerdy Git magic under the hood.</p>",
          "twitter": "gittower"
        }
      ]
    }
  ]
}
