{
  "keynotes": [
    {
      "speakers": [
        {
          "speaker-image": "tabatkins.jpg",
          "alt": "Side portrait of Tab Atkins Jr.",
          "name": "Tab Atkins Jr",
          "occupation": "Spec Hacker for Google"
        }
      ]
    }
  ],
  "talks": [
    {
      "session-title": "Future Tools: Beyond Live Style Guides",
      "speakers": [
        {
          "speaker-image": "adamdetrick.jpg",
          "alt": "Portrait of Adam Detrick",
          "name": "Adam Detrick",
          "occupation": "UI Design Architect, Meetup"
        }
      ],
      "session-description": "<p>Live style guides are widely accepted as a best practice in building user interfaces, but they don't always live up to their promise in practice. Meetup is a company with over 12 years of accumulated code, and we've been making a transition from ad-hoc UI to a more modern approach. We've learned a great deal about what works and what doesn't when trying to implement a custom CSS foundation and other design-driven tools.</p><p>In this talk, I'll be going beyond the basic idea of a live style guide, demonstrating tools and techniques that can help design ideas thrive. Fully automated documentation, package management, cross-platform color management, authoring best practices, and the <a href=http://martinfowler.com/bliki/StranglerApplication.html'>strangler pattern</a> will be covered. This talk avoids diving deeply into advanced features of Sass, focusing instead on novel approaches to the process of building user interface. Let's get ready to use and create the front end development tools of the future! </p><p>All software referenced in this talk will be open source under the MIT License and available on github.</p>"
    },
    {
      "session-title": "Thinking inside the box inside the box inside the box",
      "speakers": [
        {
          "speaker-image": "masonwendell-14.jpg",
          "alt": "Portrait of Mason Wendell",
          "name": "Mason Wendell",
          "occupation": "Senior Developer/Designer, Phase2"
        }
      ],
      "session-description": "<p>Great design, like jazz, needs both harmony and discord skillfully executed in just the right places. On the web, many of our projects are playing sour notes. Let's want to get in tune. Even in the age or Responsive Web Design, many sites are being designed from the outside in. Whether the page is defined in Photoshop or, let's hope, in-browser, many design projects slide out of tune when they get to the second or third page. Components are inconsistent, page and layout dimensions vary, font sizes shift. These details add up. Living style guides have been proposed to address this problem, the trouble is they're often extracted from the finished project. Let's design the style guide first. Start from inside out with the most common aspects of a design language. Instead of envisioning individual pages, work to create a cohesive family of components and layouts that can be assembled into any page. By leveraging a tools that help us create the elements of out design language and visualize them in various contexts, we can make components, layouts, and even working pages that snap together beautifully. It's the new blank paper. This session will focus on the principles and benefits of this approach and use real-world examples from client work and personal projects. There will be some technical examples that will range from intermediate to advanced Sass and Responsive Web Design. This will include Sass partials, extends, mixins, and Compass extensions like Breakpoint and Singularity Grid System.</p>"
    },
    {
      "session-title": "Keeping Your Sass Squeaky Clean",
      "speakers": [
        {
          "speaker-image": "adamonishi.jpg",
          "alt": "Portrait of Adam Onishi",
          "name": "Adam Onishi",
          "occupation": "Senior Front End Developer, Architect"
        }
      ],
      "session-description": "<p>In this talk, I will take a look at all the features Sass and Compass put at your disposal, showing you how they can be used in real-world situations with a case study from the new Persil.co.uk website. From making complex responsive front end builds more manageable, working with custom IE style sheets, all the way through to improving the consistency amongst a team of developers. All of this formed part of the work that went into the new Persil website. In the last few years we’ve become quite accustomed to increasing our productivity with preprocessors like Sass or LESS. But how many of us take it much further than using a few variables, nesting our selectors, and using partials. Sass brings much more functionality to the table, including loops, conditionals, functions, and mixins. Now bring Compass into the mix and you have an even more powerful combination with added functions and built-in mixins. I'll show you how you can start cleaning up your own Sass with these advanced techniques that we've been using in the Persil project.</p>"
    },
    {
      "session-title": "Style as a Service: Maintaining Style Across Multiple Websites",
      "speakers": [
        {
          "speaker-image": "shayhowe.jpg",
          "alt": "Portrait of Shay Howe",
          "name": "Shay Howe",
          "occupation": "Director of Product, Belly"
        }
      ],
      "session-description": "<p>We often build multiple websites and applications that share the same styles across multiple code bases (style guides/pattern libraries). Maintaining these styles becomes quite a task, and causes increasing frustration overtime. Fortunately it doesn’t have to be this way. Within this talk we’ll cover a service-oriented architecture approach to sharing Sass styles across multiple code bases. Geared towards designers and front-end developers, we’ll discuss at how to best structure and write style sheets for reuse and how to properly package them to be used within different development environments. Consistency shouldn’t take a back seat to maintainability, and this talk covers how to have the best of both worlds.</p>"
    },
    {
      "session-title": "Building an Artful Web",
      "speakers": [
        {
          "speaker-image": "smithschwartz.jpg",
          "alt": "Portrait of Smith Schwartz",
          "name": "Smith Schwartz",
          "occupation": "Interaction Designer, Say Media"
        }
      ],
      "session-description": "<p>Having recently made the transition from the world of art museums to the world of front-end development and design, I’ve learned that these two disciplines have more in common than one might think at first glance. There’s lots of talk in our industry about craftsmanship, but I believe we also need to strive to build a more artful web. We’ll start with a behind-the-scenes look at museums, art in the digital era, authenticity and fear, the temporal nature of what we do, and learn a bit of art history along the way.</p>"
    }
  ],
  "workshops": [
    {
      "session-title": "Expanding your Sass Arsenal",
      "speakers": [
        {
          "speaker-image": "anthonydispezio.jpg",
          "alt": "Portrait of Anthony DiSpezio",
          "name": "Anthony DiSpezio",
          "occupation": "Content Engineer, Inkling"
        }
      ],
      "session-description": "<p>Are you a Sass beginner eager to increase your experience? In this workshop we’ll take an in-depth look at some powerful features to help you write smarter Sass and cleaner CSS.</p> <h4>Topics we’ll be covering in this workshop:</h4> <ul> <li>Extends and Mixins In-Depth</li> <li>Maps and Loops</li> <li>Functions FTW</li> <li>Bulletproofing with Warnings</li> <li>Media Query Techniques</li> </ul> <p>Please bring a laptop, a great attitude, and a sense of humor!</p>"
    },
    {
      "session-title": "Optimising the Critical Rendering Path",
      "speakers": [
        {
          "speaker-image": "patrickhamann.jpg",
          "alt": "Portrait of Patrick Hamann",
          "name": "Patrick Hamann",
          "occupation": "Senior Software Engineer, The Guardian"
        }
      ],
      "session-description": "<h4>Who is it for?</h4> <p>This workshop is for any designer or developer wanting to improve the speed of their websites and have a greater understanding of the browsers internals.</p> <p> </p> <h4>What you'll learn</h4> <p>Over the 4 hours you will learn what are the common performance bottlenecks in the browser from networking to painting and learn how to best optimise at each stage of the critical path to create fast, jank free websites.</p> <h4>What this workshop will cover</h4> <ul> <li>Why performance matters</li> <li>Networking</li> <li>Render tree construction</li> <li>Measuring performance using browser developer tools</li> <li>Hardware acceleration</li> <li>Optimising CSS</li> <li>Optimising load time</li> <li>Optimising paint</li> <li>Practice on working examples</li> <li>Testing and monitoring</li> <li>Tips, tricks and best practices</li> <li>The future</li> </ul> <h4>Requirements</h4> <ul> <li>Please bring your laptop with the following installed:</li> <li>Latest Chrome browser</li> <li>Node.js</li> <li>Grunt</li> </ul>"
    },
    {
      "session-title": "Introduction into UX Regression Testing",
      "speakers": [
        {
          "speaker-image": "kevinlamping.jpg",
          "alt": "Portrait of Kevin Lamping",
          "name": "Kevin Lamping",
          "occupation": "Front-end Engineer, Rackspace"
        }
      ],
      "session-description": "<p>Test-Driven Development has grown in popularity among the community in the past few years, but we're still lacking the proper tools to provide automation behind our CSS.</p> <p>How do you know a change you made to one small section on a page doesn't break a large section on another page of your site, especially when you support hundreds of devices? </p><p>This workshop will walk through a few of the tools available to help out. We'll set up the software together, then run them against real-life scenarios to show where each succeeds and where they individually fall short. </p> <p>By the end of the workshop, attendees will have a solid understanding of what options are available and know how to add a regression test suite to any project they're currently working on.</p>"
    },
    {
      "session-title": "Choose your own Refactoring Adventure!",
      "speakers": [
        {
          "speaker-image": "elyseholladay_14.jpg",
          "alt": "Portrait of Elyse Holladay",
          "name": "Elyse Holladay",
          "occupation": "Developer/Designer, MakerSquare"
        },
        {
          "speaker-image": "jinabolton_14.jpg",
          "alt": "Portrait of Jina Bolton",
          "name": "Jina Bolton",
          "occupation": "Senior Product Designer, Salesforce UX"
        }
      ],
      "session-description": "<p>Whether you’ve been using Sass for a while or are still trying to figure out how to abandon plain CSS, refactoring a large project can be a daunting task. We all know it’s too hard to refactor everything for months and launch it all at once, so how do you begin a multi-step refactoring process?</p> <p>In this four-hour workshop, Jina and Elyse will walk you through the basics of refactoring using Sass. You’ll receive guidelines for how to refactor for clarity, maintainability, efficiency, and DRY code, and learn how to test your changes. They’ll cover ways to break down a refactor into manageable chunks, help you understand how to modularize your CSS, and organize messy code into documented, style-guide ready files. Everyone will leave with a customized game plan of steps, tools, and guidelines to refactor their project—not a sample app—so bring your project code with you.</p> <h4>Refactoring topics to be covered may include:</h4> <ul> <li>overview of ways to use Sass (CodeKit, Rails, libsass, nodesass, etc.)</li> <li>creating color and typography variables</li> <li>breaking out and importing files</li> <li>determining CSS/UI modules, where they live in your app, and how to organize them</li> <li>namespacing for style safety</li> <li>commenting and in-CSS documentation</li> <li>creating living style guides</li> <li>naming conventions and refactoring classes/IDs</li> <li>testing for changes</li> </ul>"
    }
  ]
}
